# Brewfile
# install packages:
#   brew bundle install --file ~/.Brewfile
# view installed packages:
#   brew bundle dump --force --describe --file -

# system
brew "coreutils"                 # GNU File, Shell, and Text utilities
brew "findutils"                 # Collection of GNU find, xargs, and locate
brew "moreutils"                 # Collection of tools that nobody wrote when UNIX was young
brew "gawk"                      # GNU awk utility
brew "gnu-sed"                   # GNU implementation of the famous stream editor

# monitoring
brew "baobab"                    # Gnome disk usage analyzer
brew "htop"                      # Improved top (interactive process viewer)
brew "mtr"                       # 'traceroute' and 'ping' in a single tool
brew "netcat"                    # Utility for managing network connections
brew "nmap"                      # Port scanning utility for large networks
cask "oversight"                 # Monitors computer mic and webcam
cask "sloth"                     # Displays all open files and sockets in use by all running processes
cask "stats"                     # System monitor for the menu bar

# media
brew "ffmpeg"                    # Play, record, convert, and stream select audio and video codecs
brew "spek"                      # Acoustic spectrum analyser
brew "yt-dlp"                    # Feature-rich command-line audio/video downloader
cask "foobar2000"                # Audio player
cask "licecap"                   # Animated screen capture application
cask "vlc"                       # Multimedia player

# network
cask "lulu"                      # Open-source firewall to block unknown outgoing connections
cask "mullvad-vpn"               # VPN client
cask "syncthing-app"             # Real time file synchronisation software
brew "wget"                      # Internet file retriever
cask "winbox"                    # Administration tool for MikroTik RouterOS

# development
brew "awscli"                    # Official Amazon AWS command-line interface
brew "chroma"                    # General purpose syntax highlighter in pure Go
brew "cmctl"                     # Command-line tool to manage cert-manager
brew "gcc"                       # GNU compiler collection
brew "git"                       # Distributed revision control system
brew "helm"                      # Kubernetes package manager
brew "jq"                        # Lightweight and flexible command-line JSON processor
brew "k3d"                       # Little helper to run CNCF's k3s in Docker
brew "kubernetes-cli"            # Kubernetes command-line interface
brew "krew"                      # Package manager for kubectl plugins
brew "pandoc"                    # Swiss-army knife of markup format conversion
brew "podman"                    # Tool for managing OCI containers and pods
brew "rust"                      # Safe, concurrent, practical language
brew "uv"                        # Extremely fast Python package installer and resolver, written in Rust
brew "yq"                        # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "zbar"                      # Suite of barcodes-reading tools

# crypto
brew "gnupg"                     # GNU Privacy Guard (OpenPGP)
cask "keepassxc"                 # Password manager app

# productivity
brew "arthur-ficial/tap/apfel"   # On-device Apple FoundationModels CLI and OpenAI-compatible server
brew "ctags"                     # Reimplementation of ctags(1)
brew "tmux"                      # Terminal multiplexer
brew "vim"                       # Vi 'workalike' with many additional features
cask "alacritty"                 # GPU-accelerated terminal emulator
cask "firefox@nightly"           # Web browser
cask "obsidian"                  # Knowledge base that works on top of a local folder of plain text Markdown files
cask "ollama-app"                # Run local LLMs
